# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge of one-to-many and many-to-many relationships!

## Objectives

You will be able to:
* Explain one-to-many and many-to-many joins as well as implications for the size of query results
* Query data using one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [3]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a DataFrame with all of the employees including their first name and last name along with the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [13]:
dfa =   pd.DataFrame(cur.execute("""SELECT *
                                    FROM employees
                                    JOIN offices
                                    USING(officeCode)""").fetchall())
print(len(dfa))
dfa.head()

23

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,,President,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002,VP Sales,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002,VP Marketing,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056,Sales Manager (APAC),Sydney,+61 2 9264 2451,5-11 Wentworth Avenue,Floor #2,,Australia,NSW 2010,APAC
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056,Sale Manager (EMEA),Paris,+33 14 723 4404,43 Rue Jouffroy D'abbans,,,France,75017,EMEA

## Customers and their Orders (a One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' order numbers, order dates, and statuses.

In [17]:
dfb = pd.DataFrame(cur.execute("""SELECT contactLastName, contactFirstName, orderNumber, status
                                  FROM customers
                                  JOIN orders
                                  USING(customerNumber)"""))
dfb.head()

         0        1      2        3
0  Schmitt  Carine   10123  Shipped
1  Schmitt  Carine   10298  Shipped
2  Schmitt  Carine   10345  Shipped
3     King     Jean  10124  Shipped
4     King     Jean  10278  Shipped

## Customers and their Payments (another One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' payment amounts and date of payment. Sort these results in descending order by the payment amount.

In [28]:
cur.execute("""SELECT contactFirstName, contactLastName, paymentDate, amount
               FROM customers
               JOIN payments
               USING(customerNumber)
               ORDER BY amount desc""")
dfc = pd.DataFrame(cur.fetchall())
dfc.columns = (i[0] for i in cur.description)
print(len(dfc))
dfc.head()

273

  contactFirstName contactLastName paymentDate     amount
0           Diego           Freyre  2005-03-18  120166.58
1           Diego           Freyre  2004-12-31  116208.40
2            Susan          Nelson  2003-08-15  111654.40
3             Eric       Natividad  2003-12-26  105743.00
4            Susan          Nelson  2005-03-05  101244.59

## Orders, Order details, and Product Details (a Many-to-Many Join)

Return a DataFrame with all of the customer contacts (first and last names) along with the product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

> Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries that can make complex queries such as this much simpler!

In [30]:
cur.execute("""SELECT contactFirstName, contactLastName, orderDate, quantityOrdered, productName
               FROM customers
               JOIN orders
               USING(customerNumber)
               JOIN orderdetails
               USING(orderNumber)
               JOIN products
               USING(productCode)
               ORDER BY orderDate DESC""")
dfd = pd.DataFrame(cur.fetchall())
dfd.columns = (i[0] for i in cur.description)
print(len(dfd))
dfd.head()

2996

,contactFirstName,contactLastName,orderDate,quantityOrdered,productName
0,Janine,Labrune,2005-05-31,38,1962 LanciaA Delta 16V
1,Janine,Labrune,2005-05-31,33,1957 Chevy Pickup
2,Janine,Labrune,2005-05-31,28,1998 Chrysler Plymouth Prowler
3,Janine,Labrune,2005-05-31,38,1964 Mercedes Tour Bus
4,Janine,Labrune,2005-05-31,19,1926 Ford Fire Engine

## Summary

In this lab, you practiced your knowledge of one-to-many and many-to-many relationships!